load-test.yml
config:
  target: 'http://localhost:5000'
  phases:
    # Warm up phase
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    # Gradual ramp up to peak traffic
    - duration: 180
      arrivalRate: 100
      rampTo: 500
      name: "Ramp up to moderate load"
    # Peak traffic simulation - 10,000 concurrent users
    - duration: 300
      arrivalRate: 1000
      name: "Peak traffic test - 10k concurrent users"
    # Sustained high load
    - duration: 120
      arrivalRate: 800
      name: "Sustained high load"
  processor: "./test-functions.js"
  # Performance thresholds
  ensure:
    thresholds:
      - http.response_time.p95: 5000  # 95% of requests under 5s
      - http.response_time.p50: 2000  # 50% of requests under 2s
      - http.request_rate: 800        # Minimum requests per second

scenarios:
  # Login Authentication Test - Must complete within 1 second
  - name: "Login Authentication Performance"
    weight: 20
    flow:
      - post:
          url: "/api/users/login"
          json:
            username: "testuser{{ $randomInt(1, 1000) }}"
            password: "testpass123"
          expect:
            - statusCode: [200, 401] # Accept both success and auth failure
          capture:
            - json: "$.token"
              as: "authToken"
          # Assertion: Login must complete within 1 second
          think: 0.1
      - log: "Login response time: {{ $responseTime }}ms (Target: <1000ms)"

  # Product Search Test - Must display within 2 seconds for 100k+ items
  - name: "Product Search Performance"
    weight: 25
    flow:
      - get:
          url: "/api/products"
          expect:
            - statusCode: 200
          # Simulate large product catalog search
      - get:
          url: "/api/products/search?q=auto&limit=100"
          expect:
            - statusCode: 200
          # Assertion: Search must complete within 2 seconds
      - get:
          url: "/api/products/search?q=parts&category=engine&limit=50"
          expect:
            - statusCode: 200
      - log: "Product search response time: {{ $responseTime }}ms (Target: <2000ms)"

  # Checkout Process Test - Must complete within 5 seconds
  - name: "Checkout Process Performance"
    weight: 20
    flow:
      # Add items to cart
      - post:
          url: "/api/cart/add"
          json:
            productId: "{{ $randomInt(1, 1000) }}"
            quantity: "{{ $randomInt(1, 5) }}"
            userId: "{{ $randomInt(1, 10000) }}"
      # Get cart contents
      - get:
          url: "/api/cart/{{ $randomInt(1, 10000) }}"
      # Process checkout
      - post:
          url: "/api/checkout"
          json:
            userId: "{{ $randomInt(1, 10000) }}"
            paymentMethod: "credit_card"
            shippingAddress: 
              street: "123 Test St"
              city: "Test City"
              zipCode: "12345"
          expect:
            - statusCode: [200, 201]
      - log: "Checkout process time: {{ $responseTime }}ms (Target: <5000ms)"

  # Order Placement Test - Confirmation within 3 seconds
  - name: "Order Placement Performance"
    weight: 25
    flow:
      - post:
          url: "/api/orders"
          json:
            productId: "{{ $randomInt(1, 1000) }}"
            quantity: "{{ $randomInt(1, 3) }}"
            userId: "{{ $randomInt(1, 10000) }}"
            totalAmount: "{{ $randomInt(50, 500) }}.99"
          expect:
            - statusCode: [200, 201]
          capture:
            - json: "$.orderId"
              as: "orderId"
      # Get order confirmation
      - get:
          url: "/api/orders/{{ orderId }}"
          expect:
            - statusCode: 200
      - log: "Order placement + confirmation time: {{ $responseTime }}ms (Target: <3000ms)"

  # High-Volume API Health Check
  - name: "API Health Check Under Load"
    weight: 10
    flow:
      - get:
          url: "/api/products"
          expect:
            - statusCode: 200
      - get:
          url: "/api/users/profile/{{ $randomInt(1, 10000) }}"
          expect:
            - statusCode: [200, 404]